/*ВСЕ ЗРОБИТИ СТРІЛОЧНИМИ ФУНКЦІЯМИ!

- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
- створити функцію яка повертає найменьше число з масиву
- створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
- створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
- Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250
*/

/*- створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б*/
let rettangleArea = (a, b) => a*b;
console.log(rettangleArea(3, 4));

/*- створити функцію яка обчислює та повертає площу кола з радіусом r*/
let circleArea =  (r) => Math.pow(r,2) * Math.PI;
let result = circleArea(4);
console.log(result);

/*- створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r*/
let cilinderArea = (h, radius) =>  2 * Math.PI * Math.pow(radius, 2) + 2 * Math.PI * h * radius;
let cilinder = cilinderArea(7,3);
console.log(cilinder);

/*- створити функцію яка приймає масив та виводить кожен його елемент*/
let randomArray = (array) =>{
    for (let i = 0; i < array.length; i++) {
        const arrayElement = array[i];
        console.log(arrayElement);
    }
}
randomArray([3, 4,5]);

/*- створити функцію яка створює параграф з текстом.
Текст задати через аргумент*/
let paragraph = (text) => {
    document.write(`<p>${text}</p>`)
}
paragraph('lalala');

/*- створити функцію яка створює ul з трьома елементами li.
Текст li задати через аргумент всім однаковий*/
let ulList = (liText) =>{
    document.write(`<ul>`);
    for (let i = 0; i < 3; i++) {
        document.write(`<li>${liText}</li>`);
    }
    document.write(`</ul>`);

}
ulList('bvc')